<?php

//Тестовый текст с различными вариантами написания телефонного номера

$text = "First1 -> +380957033008,".'<br>'."First2 -> +38 0957033008,".'<br>'."First3 -> +38 095 7033008,".'<br>'.
    "First4 -> +38 095 703 3008,".'<br>'."First5 -> +38 095 703 30 08,".'<br>'."First6 -> +38-095-703-3008,".'<br>'.
    "First7 -> +38-095-703-30-08,".'<br>'."---".'<br>'.
    "Second1 -> +38(095)7033008, ".'<br>'."Second2 -> +38 (095)7033008,".'<br>'."Second3 -> +38 (095) 7033008, ".'<br>'.
    "Second4 -> +38 (095) 703 3008, ".'<br>'."Second5 -> +38 (095) 703 30 08,".'<br>'."Second6 -> +38-(095)-703-3008,".'<br>'.
    "Second7 -> +38-(095)-703-30-08,".'<br>'."---".'<br>'.
    "Third1 -> 38(095)7033008, ".'<br>'."Third2 -> 38 (095)7033008,".'<br>'."Third3 -> 38 (095) 7033008, ".'<br>'.
    "Third4 -> 38 (095) 703 3008, ".'<br>'."Third5 -> 38 (095) 703 30 08,".'<br>'."Third6 -> 38-(095)-703-3008,".'<br>'.
    "Third7 -> 38-(095)-703-30-08,".'<br>'."---".'<br>'.
    "Fourth1 -> 8(095)7033008, ".'<br>'."Fourth2 -> 8 (095)7033008,".'<br>'."Fourth3 -> 8 (095) 7033008, ".'<br>'.
    "Fourth4 -> 8 (095) 703 3008, ".'<br>'."Fourth5 -> 8 (095) 703 30 08,".'<br>'."Fourth6 -> 8-(095)-703-3008,".'<br>'.
    "Fourth7 -> 8-(095)-703-30-08,".'<br>'."---".'<br>'.
    "Fifth1 -> (095)7033008, ".'<br>'."Fifth2 -> (095) 7033008, ".'<br>'."Fifth3 -> (095) 703 3008, ".'<br>'.
    "Fifth4 -> (095) 703 30 08,".'<br>'."Fifth5 -> (095)-703-3008,".'<br>'."Fifth6 -> (095)-703-30-08,".'<br>'."---".'<br>'.
    "Sixth1 -> 0957033008, ".'<br>'."Sixth2 -> 095 7033008, ".'<br>'."Sixth3 -> 095 703 3008, ".'<br>'.
    "Sixth4 -> 095 703 30 08,".'<br>'."Sixth5 -> 095-703-3008,".'<br>'."Sixth6 -> 095-703-30-08,".'<br>'."";


// Вывод результата
echo "---SOURCE---".'<br>'.$text.'<br>'."---RESULT---".'<br>'.changeNumber($text);

function changeNumber ($text)
{
    //регулярное выражение используемое для выбора телефонных номеров из текста
    $regular = "~(?:\+|\d|\()[\d\-\(\) ]{8,}\d~";

    // меняем выбранные номера на заданную фразу
    $text = preg_replace($regular, "<i style='color: blue'>Show phone number</i>", $text);

    return $text;
}